# customer-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=1sv926z3fc]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-customer_api]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer_api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_api-20230517051049745000000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-450d6976-4808-49d5-a408-04cc68a55ebc]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=b844a903092009c946d0a65b196291a61352a901]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=63joby6]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=z7xci6s]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_api"
      ~ last_modified                  = "2023-05-23T23:10:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "f5f8VxsGBc8J89RWbvAZB7bILj4GWYg3G5yBqoDK2tw=" -> "MoxqiQ/Brz+tHcx6VIHhJIzeSj5wRB2FXf03SnjZg2M="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"      = "fast-anteater-6016-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"            = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"             = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"               = "677ab0ecb97b47f885d236ad095d2dce"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"         = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"               = "ZmFzdC1hbnRlYXRlci02MDE2JIMxGX-WLd9KubI1dJqBcDG6YO8ZpXdOzsH8K50"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"            = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL" = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_gl21W78mM/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api"
        name       = "customer_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "d765dcce-67fd-4092-a17d-b147f91e9d8f" -> "7f0854a5-fd52-45dc-bddc-f8bf75b05aeb"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*